[{"id":"100","title":"Vue.js - The Complete Guide","imgUrl":"https://vuejs.org/images/logo.png","description":"This bestselling book teaches the latest version of Vue (Vue.js 3) from the ground up and in great detail. We'll cover all the core basics but we'll not stop thereafter - this course also dives into advanced concepts like the Composition API introduced with Vue 3.\r\n\r\nFrontend frameworks like Vue JS are extremely popular because they give us this reactive, great user experience we know from mobile apps - but now in the browser! No wonder that jobs requiring frontend framework skills like VueJS are amongst the best paid ones in the industry!","price":"9.99"},{"id":"101","title":"Node.js - The Complete Guide","imgUrl":"https://nodejs.org/static/images/logo-hexagon-card.png","description":"Node.js is probably THE most popular and modern server-side programming language you can dive into these days!\r\n\r\nNode.js developers are in high demand and the language is used for everything from traditional web apps with server-side rendered views over REST APIs all the way up to GraphQL APIs and real-time web services. Not to mention its applications in build workflows for projects of all sizes.\r\n\r\nThis book will teach you all of that! From scratch with zero prior knowledge assumed.","price":"12.99"},{"id":"0.06088267930595337","title":"JavaScript - The Complete Guide","imgUrl":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/480px-Unofficial_JavaScript_logo_2.svg.png","description":"JavaScript is THE most important programming language you need to learn as a web developer - and with this course, you make sure that you will not miss a single thing you have to know as a JavaScript developer!\r\n\r\nThis is the most comprehensive and modern course you can find on JavaScript - it's based on all my JavaScript knowledge AND teaching experience. It's both a complete guide, starting with the core basics of the language, as well as an extensive reference of the JavaScript language and environment, ensuring that both newcomers as well as experienced JavaScript developers get a lot out of this book!","price":"12.99"}]